Tekla Open API Reference for Tekla Structures 2025
IndirectPolymeshEdge.StartPoint Property
 Start point of the edge.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int StartPoint { get; set; }
Public Property StartPoint As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
IndirectPolymeshEdge Class
Tekla.Structures.Geometry3d Namespace